============================================================================================================================================================================================================================
Layer (type:depth-idx)                        Input Shape               Output Shape              Param #                   Param %                   Kernel Shape              Mult-Adds                 Trainable
============================================================================================================================================================================================================================
FullModel                                     [1, 1, 1, 160, 160]       [1, 3, 4]                 --                             --                   --                        --                        True
├─Frontnet: 1-1                               [1, 1, 160, 160]          [1, 64]                   --                             --                   --                        --                        True
│    └─Conv2d: 2-1                            [1, 1, 160, 160]          [1, 16, 80, 80]           400                         0.37%                   [5, 5]                    2,560,000                 True
│    └─BatchNorm2d: 2-2                       [1, 16, 80, 80]           [1, 16, 80, 80]           32                          0.03%                   --                        32                        True
│    └─ReLU: 2-3                              [1, 16, 80, 80]           [1, 16, 80, 80]           --                             --                   --                        --                        --
│    └─MaxPool2d: 2-4                         [1, 16, 80, 80]           [1, 16, 40, 40]           --                             --                   2                         --                        --
│    └─ConvBlock: 2-5                         [1, 16, 40, 40]           [1, 16, 20, 20]           --                             --                   --                        --                        True
│    │    └─Conv2d: 3-1                       [1, 16, 40, 40]           [1, 16, 20, 20]           2,304                       2.11%                   [3, 3]                    921,600                   True
│    │    └─BatchNorm2d: 3-2                  [1, 16, 20, 20]           [1, 16, 20, 20]           32                          0.03%                   --                        32                        True
│    │    └─ReLU: 3-3                         [1, 16, 20, 20]           [1, 16, 20, 20]           --                             --                   --                        --                        --
│    │    └─Conv2d: 3-4                       [1, 16, 20, 20]           [1, 16, 20, 20]           2,304                       2.11%                   [3, 3]                    921,600                   True
│    │    └─BatchNorm2d: 3-5                  [1, 16, 20, 20]           [1, 16, 20, 20]           32                          0.03%                   --                        32                        True
│    │    └─ReLU: 3-6                         [1, 16, 20, 20]           [1, 16, 20, 20]           --                             --                   --                        --                        --
│    └─ConvBlock: 2-6                         [1, 16, 20, 20]           [1, 32, 10, 10]           --                             --                   --                        --                        True
│    │    └─Conv2d: 3-7                       [1, 16, 20, 20]           [1, 32, 10, 10]           4,608                       4.23%                   [3, 3]                    460,800                   True
│    │    └─BatchNorm2d: 3-8                  [1, 32, 10, 10]           [1, 32, 10, 10]           64                          0.06%                   --                        64                        True
│    │    └─ReLU: 3-9                         [1, 32, 10, 10]           [1, 32, 10, 10]           --                             --                   --                        --                        --
│    │    └─Conv2d: 3-10                      [1, 32, 10, 10]           [1, 32, 10, 10]           9,216                       8.45%                   [3, 3]                    921,600                   True
│    │    └─BatchNorm2d: 3-11                 [1, 32, 10, 10]           [1, 32, 10, 10]           64                          0.06%                   --                        64                        True
│    │    └─ReLU: 3-12                        [1, 32, 10, 10]           [1, 32, 10, 10]           --                             --                   --                        --                        --
│    └─ConvBlock: 2-7                         [1, 32, 10, 10]           [1, 64, 5, 5]             --                             --                   --                        --                        True
│    │    └─Conv2d: 3-13                      [1, 32, 10, 10]           [1, 64, 5, 5]             18,432                     16.91%                   [3, 3]                    460,800                   True
│    │    └─BatchNorm2d: 3-14                 [1, 64, 5, 5]             [1, 64, 5, 5]             128                         0.12%                   --                        128                       True
│    │    └─ReLU: 3-15                        [1, 64, 5, 5]             [1, 64, 5, 5]             --                             --                   --                        --                        --
│    │    └─Conv2d: 3-16                      [1, 64, 5, 5]             [1, 64, 5, 5]             36,864                     33.81%                   [3, 3]                    921,600                   True
│    │    └─BatchNorm2d: 3-17                 [1, 64, 5, 5]             [1, 64, 5, 5]             128                         0.12%                   --                        128                       True
│    │    └─ReLU: 3-18                        [1, 64, 5, 5]             [1, 64, 5, 5]             --                             --                   --                        --                        --
│    └─Sequential: 2-8                        [1, 64, 5, 5]             [1, 64]                   --                             --                   --                        --                        --
│    │    └─AvgPool2d: 3-19                   [1, 64, 5, 5]             [1, 64, 1, 1]             --                             --                   5                         --                        --
│    │    └─Flatten: 3-20                     [1, 64, 1, 1]             [1, 64]                   --                             --                   --                        --                        --
├─TCN: 1-2                                    [1, 3, 64]                [1, 3, 64]                --                             --                   --                        --                        True
│    └─TCN: 2-9                               [1, 3, 64]                [1, 3, 64]                --                             --                   --                        --                        True
│    │    └─ModuleList: 3-21                  --                        --                        --                             --                   --                        --                        True
│    │    │    └─TemporalBlock: 4-1           [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        True
│    │    │    │    └─CausalConv1d: 5-1       [1, 64, 3]                [1, 64, 3]                8,320                       7.63%                   [2]                       528,576                   True
│    │    │    │    └─ReLU: 5-2               [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─Dropout: 5-3            [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─CausalConv1d: 5-4       [1, 64, 3]                [1, 64, 3]                8,320                       7.63%                   [2]                       528,576                   True
│    │    │    │    └─ReLU: 5-5               [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─Dropout: 5-6            [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─ReLU: 5-7               [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    └─TemporalBlock: 4-2           [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        True
│    │    │    │    └─CausalConv1d: 5-8       [1, 64, 3]                [1, 64, 3]                8,320                       7.63%                   [2]                       528,576                   True
│    │    │    │    └─ReLU: 5-9               [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─Dropout: 5-10           [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─CausalConv1d: 5-11      [1, 64, 3]                [1, 64, 3]                8,320                       7.63%                   [2]                       528,576                   True
│    │    │    │    └─ReLU: 5-12              [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─Dropout: 5-13           [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
│    │    │    │    └─ReLU: 5-14              [1, 64, 3]                [1, 64, 3]                --                             --                   --                        --                        --
├─MLPRegressor: 1-3                           [3, 64]                   [3, 4]                    --                             --                   --                        --                        True
│    └─Sequential: 2-10                       [3, 64]                   [3, 4]                    --                             --                   --                        --                        True
│    │    └─Linear: 3-22                      [3, 64]                   [3, 16]                   1,040                       0.95%                   --                        3,120                     True
│    │    └─BatchNorm1d: 3-23                 [3, 16]                   [3, 16]                   32                          0.03%                   --                        96                        True
│    │    └─ReLU: 3-24                        [3, 16]                   [3, 16]                   --                             --                   --                        --                        --
│    │    └─Dropout: 3-25                     [3, 16]                   [3, 16]                   --                             --                   --                        --                        --
│    │    └─Linear: 3-26                      [3, 16]                   [3, 4]                    68                          0.06%                   --                        204                       True
============================================================================================================================================================================================================================
Total params: 109,028
Trainable params: 109,028
Non-trainable params: 0
Total mult-adds (M): 9.29
============================================================================================================================================================================================================================
Input size (MB): 0.10
Forward/backward pass size (MB): 2.00
Params size (MB): 0.44
Estimated Total Size (MB): 2.54
============================================================================================================================================================================================================================